server/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ryotaro Hayashi"], ["email", "hys.rtr.forit@gmail.com"], ["password", "Rtrhys331"], ["created_at", "2020-01-04 18:36:13.882692"], ["updated_at", "2020-01-04 18:36:13.882692"]]
---
      def create
        user = User.new(user_params)
        if user.save