back/app/controllers/api/post/questions_controller.rb

      def index
        questions = Question.all
---
SELECT `questions`.* FROM `questions`