back/app/controllers/api/post/questions_controller.rb

      def create
        question = Question.new(question_params)
        question.user_id = current_api_user.id
        if question.save
---
INSERT INTO `questions` (`title`, `body`, `date`, `user_id`, `created_at`, `updated_at`) VALUES ('5ÂõûÁõÆ„ÅÆÊäïÁ®ø', '5ÂõûÁõÆ„Äú„Äú„Äú', '', 1, '2020-02-06 04:36:11', '2020-02-06 04:36:11')

      def index
        questions = Question.all.order(created_at: :desc)
---
SELECT `questions`.* FROM `questions` ORDER BY `questions`.`created_at` DESC

      def show
        question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

      def mypost
        user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1