back/app/controllers/api/v1/users_controller.rb

      def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO `users` (`name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('test', 'testemail', 'testpass', '2020-01-19 13:15:59', '2020-01-19 13:15:59')

      def index
        users = User.all
---
SELECT `users`.* FROM `users`